podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SYSCON_LPC11Uxx.svd.xml
            <register>
               <name>SYSRSTSTAT</name>
               <description>System reset status register</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x3</resetValue>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>POR reset status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_POR_DETECTED</name>
                           <description>No POR detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POR_DETECTED_WRITIN</name>
                           <description>POR detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>External reset status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RESET_EVENT_DETEC</name>
                           <description>No reset event detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET_DETECTED_WRIT</name>
                           <description>Reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Status of the Watchdog reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_WDT_RESET_DETECTE</name>
                           <description>No WDT reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_RESET_DETECTED_</name>
                           <description>WDT reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOD</name>
                     <description>Status of the Brown-out detect reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BOD_RESET_DETECTE</name>
                           <description>No BOD reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOD_RESET_DETECTED_</name>
                           <description>BOD reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRST</name>
                     <description>Status of the software system reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_SYSTEM_RESET_DETE</name>
                           <description>No System reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_RESET_DETECTE</name>
                           <description>System reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKSEL</name>
               <description>System PLL clock source select</description>
               <addressOffset>0x40</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>System PLL clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC</name>
                           <description>IRC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_OSCILLATOR_</name>
                           <description>Crystal Oscillator (SYSOSC)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKUEN</name>
               <description>System PLL clock source update enable</description>
               <addressOffset>0x44</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable system PLL clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBPLLCLKSEL</name>
               <description>USB PLL clock source select</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>USB PLL clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_THE_USB_PLL_CLO</name>
                           <description>IRC. The USB PLL clock source must be switched to system oscillator for correct full-speed USB operation. The IRC is suitable for low-speed USB operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_OSCILLATOR</name>
                           <description>System oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBPLLCLKUEN</name>
               <description>USB PLL clock source update enable</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable USB PLL clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKSEL</name>
               <description>Main clock source select</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Clock source for main clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC Oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_INPUT</name>
                           <description>PLL input</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_OUTPUT</name>
                           <description>PLL output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKUEN</name>
               <description>Main clock source update enable</description>
               <addressOffset>0x74</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable main clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKDIV</name>
               <description>System clock divider</description>
               <addressOffset>0x78</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>System AHB clock divider values 0: System clock disabled.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKCTRL</name>
               <description>System clock control</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0x801485F</resetValue>
               <fields>
                  <field>
                     <name>SYS</name>
                     <description>Enables the clock for the AHB, the APB bridge, the Cortex-M0 FCLK and HCLK, SysCon, and the PMU. This bit is read only and always reads as 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROM</name>
                     <description>Enables clock for ROM</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ROM" > <name>RAM0</name> <description>Enables clock for RAM</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>FLASHREG</name> <description>Enables clock for flash register interface</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>FLASHARRAY</name> <description>Enables clock for flash array access</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C</name> <description>Enables clock for I2C</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>GPIO</name> <description>Enables clock for GPIO port</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT16B0</name> <description>Enables clock for 16-bit counter/timer 0</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT16B1</name> <description>Enables clock for 16-bit counter/timer 1</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT32B0</name> <description>Enables clock for 32-bit counter/timer 0</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT32B1</name> <description>Enables clock for 32-bit counter/timer 1</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SSP0</name> <description>Enables clock for SSP0</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>USART</name> <description>Enables clock for UART</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>ADC</name> <description>Enables clock for ADC</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>USB</name> <description>Enables clock to the USB register interface</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>WWDT</name> <description>Enables clock for WWDT</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>IOCON</name> <description>Enables clock for I/O configuration block</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SSP1</name> <description>Enables clock for SSP1</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>PINT</name> <description>Enables clock to GPIO Pin interrupts register interface</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>GROUP0INT</name> <description>Enables clock to GPIO GROUP0 interrupt register interface</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>GROUP1INT</name> <description>Enables clock to GPIO GROUP1 interrupt register interface</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>RAM1</name> <description>Enables SRAM1 block at address 0x2000 0000. See Section 3.1 for availability of this bit</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>USBRAM</name> <description>Enables USB SRAM block at address 0x2000 4000</description> <bitOffset>27</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SSP0CLKDIV</name>
               <description>SSP0 clock divider</description>
               <addressOffset>0x94</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SPI0_PCLK clock divider values.  0: System clock disabled.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKDIV</name>
               <description>UART clock divider</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>UART_PCLK clock divider values 0: Disable UART_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSP1CLKDIV</name>
               <description>SSP1 clock divider</description>
               <addressOffset>0x9C</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SSP1_PCLK clock divider values 0: Disable SSP1_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKSEL</name>
               <description>USB clock source select</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>USB clock source. Values 0x2 and 0x3 are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>USB_PLL_OUT</name>
                           <description>USB PLL out</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKUEN</name>
               <description>USB clock source update enable</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable USB clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKDIV</name>
               <description>USB clock source divider</description>
               <addressOffset>0xC8</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>USB clock divider values 0: Disable USB clock.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
