podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SYSCON_LPC11Uxx.svd.xml
            <register>
               <name>CLKOUTSEL</name>
               <description>CLKOUT clock source select</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>CLKOUT clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_OSCILLATOR_</name>
                           <description>Crystal oscillator (SYSOSC)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LF_OSCILLATOR_WATCH</name>
                           <description>LF oscillator (watchdog oscillator)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTUEN</name>
               <description>CLKOUT clock source update enable</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable CLKOUT clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTDIV</name>
               <description>CLKOUT clock divider</description>
               <addressOffset>0xE8</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>CLKOUT clock divider values 0: Disable CLKOUT clock divider.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP0</name>
               <description>POR captured PIO status 0</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PIOSTAT</name>
                     <description>State of PIO0_23 through PIO0_0 at power-on reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP1</name>
               <description>POR captured PIO status 1</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PIOSTAT</name>
                     <description>State of PIO1_31 through PIO1_0 at power-on reset</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>BODCTRL</name>
               <description>Brown-Out Detect</description>
               <addressOffset>0x150</addressOffset>
               <fields>
                  <field>
                     <name>BODRSTLEV</name>
                     <description>BOD reset level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LEVEL_0_THE_RESET_A</name>
                           <description>Level 0: The reset assertion threshold voltage is 1.46 V; the reset de-assertion threshold voltage is 1.63 V</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_1_THE_RESET_A</name>
                           <description>Level 1: The reset assertion threshold voltage is 2.06 V; the reset de-assertion threshold voltage is 2.15 V</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2_THE_RESET_A</name>
                           <description>Level 2: The reset assertion threshold voltage is 2.35 V; the reset de-assertion threshold voltage is 2.43 V</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_3_THE_RESET_A</name>
                           <description>Level 3: The reset assertion threshold voltage is 2.63 V; the reset de-assertion threshold voltage is 2.71 V</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BODINTVAL</name>
                     <description>BOD interrupt level</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LEVEL_0_RESERVED_</name>
                           <description>Level 0: Reserved</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_1THE_INTERRUP</name>
                           <description>Level 1:The interrupt assertion threshold voltage is 2.22 V; the interrupt de-assertion threshold voltage is 2.35 V</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2_THE_INTERRU</name>
                           <description>Level 2: The interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_3_THE_INTERRU</name>
                           <description>Level 3: The interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BODRSTENA</name>
                     <description>BOD reset enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_RESET_FUNCTI</name>
                           <description>Disable reset function</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_RESET_FUNCTIO</name>
                           <description>Enable reset function</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSTCKCAL</name>
               <description>System tick counter calibration</description>
               <addressOffset>0x154</addressOffset>
               <resetValue>0x4</resetValue>
               <fields>
                  <field>
                     <name>CAL</name>
                     <description>System tick timer calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>26</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQLATENCY</name>
               <description>IQR delay. Allows trade-off between interrupt latency and determinism</description>
               <addressOffset>0x170</addressOffset>
               <resetValue>0x10</resetValue>
               <fields>
                  <field>
                     <name>LATENCY</name>
                     <description>8-bit latency value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMISRC</name>
               <description>NMI Source Control</description>
               <addressOffset>0x174</addressOffset>
               <fields>
                  <field>
                     <name>IRQNO</name>
                     <description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 is 1. See Table 58 for the list of interrupt sources and their IRQ numbers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NMIEN</name>
                     <description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>PINTSEL%s</name>
               <description>GPIO Pin Interrupt Select register %</description>
               <addressOffset>0x178</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>INTPIN</name>
                     <description>Pin number select for pin interrupt. (PIO0_0 to PIO0_23 correspond to numbers 0 to 23 and PIO1_0 to PIO1_31 correspond to numbers 24 to 55)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKCTRL</name>
               <description>USB clock control</description>
               <addressOffset>0x198</addressOffset>
               <fields>
                  <field>
                     <name>AP_CLK</name>
                     <description>USB need_clock signal control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNDER_HARDWARE_CONTR</name>
                           <description>Under hardware control</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCED_HIGH_</name>
                           <description>Forced HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POL_CLK</name>
                     <description>USB need_clock polarity for triggering the USB wake-up interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FALLING_EDGE_OF_THE_</name>
                           <description>Falling edge of the USB need_clock triggers the USB wake-up (default)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_EDGE_OF_THE_U</name>
                           <description>Rising edge of the USB need_clock triggers the USB wake-up</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBCLKST</name>
               <description>USB clock status</description>
               <addressOffset>0x19C</addressOffset>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>NEED_CLKST</name>
                     <description>USB need_clock signal status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>LOW</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>HIGH</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STARTERP0</name>
               <description>Start logic 0 interrupt wake-up enable register 0</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>PINT0</name>
                     <description>Pin interrupt 0 wake-up</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PINT0" > <name>PINT1</name> <description>Pin interrupt 1 wake-up</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT2</name> <description>Pin interrupt 2 wake-up</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT3</name> <description>Pin interrupt 3 wake-up</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT4</name> <description>Pin interrupt 4 wake-up</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT5</name> <description>Pin interrupt 5 wake-up</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT6</name> <description>Pin interrupt 6 wake-up</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT7</name> <description>Pin interrupt 7 wake-up</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>STARTERP1</name>
               <description>Start logic 1 interrupt wake-up enable register 1</description>
               <addressOffset>0x214</addressOffset>
               <fields>
                  <field>
                     <name>WWDTINT</name>
                     <description>WWDT interrupt wake-up</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="WWDTINT" > <name>BODINT</name> <description>Brown Out Detect (BOD) interrupt wake-up</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="WWDTINT" > <name>USB_WAKEUP</name> <description>USB need_clock signal wake-up</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="WWDTINT" > <name>GPIOINT0</name> <description>GPIO GROUP0 interrupt wake-up</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WWDTINT" > <name>GPIOINT1</name> <description>GPIO GROUP1 interrupt wake-up</description> <bitOffset>21</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PDSLEEPCFG</name>
               <description>Power-down states in deep-sleep mode</description>
               <addressOffset>0x230</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>BOD_PD</name>
                     <description>BOD power-down control for Deep-sleep and Power-down mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BOD_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator power-down control for Deep-sleep and Power-down mode</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PDAWAKECFG</name>
               <description>Power-down states for wake-up from deep-sleep</description>
               <addressOffset>0x234</addressOffset>
               <resetValue>0xEDF0</resetValue>
               <fields>
                  <field>
                     <name>IRCOUT_PD</name>
                     <description>IRC oscillator output wake-up configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IRCOUT_PD" > <name>IRC_PD</name> <description>IRC oscillator power-down wake-up configuration</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>FLASH_PD</name> <description>Flash wake-up configuration</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>BOD_PD</name> <description>BOD wake-up configuration</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ADC_PD</name> <description>ADC wake-up configuration</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSOSC_PD</name> <description>Crystal oscillator wake-up configuration</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator wake-up configuration</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSPLL_PD</name> <description>System PLL wake-up configuration</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>USBPLL_PD</name> <description>USB PLL wake-up configuration</description> <bitOffset>8</bitOffset> </field>
                  <field>
                     <name>USBPAD_PD</name>
                     <description>USB transceiver wake-up configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>USB_TRANSCEIVER_POWE</name>
                           <description>USB transceiver powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USB_TRANSCEIVER_POWE</name>
                           <description>USB transceiver powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
