podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SYSCON_LPC11Uxx.svd.xml
            <register>
               <name>PDRUNCFG</name>
               <description>Power configuration register</description>
               <addressOffset>0x238</addressOffset>
               <resetValue>0xEDF0</resetValue>
               <fields>
                  <field>
                     <name>IRCOUT_PD</name>
                     <description>IRC oscillator output power-down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IRCOUT_PD" > <name>IRC_PD</name> <description>IRC oscillator power-down</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>FLASH_PD</name> <description>Flash power-down</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>BOD_PD</name> <description>BOD power-down</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ADC_PD</name> <description>ADC power-down</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSOSC_PD</name> <description>Crystal oscillator power-down</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator power-down</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSPLL_PD</name> <description>System PLL power-down</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>USBPLL_PD</name> <description>USB PLL power-down</description> <bitOffset>8</bitOffset> </field>
                  <field>
                     <name>USBPAD_PD</name>
                     <description>USB transceiver power-down configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>USB_TRANSCEIVER_POWE</name>
                           <description>USB transceiver powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USB_TRANSCEIVER_POWE</name>
                           <description>USB transceiver powered down (suspend mode)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICE_ID</name>
               <description>Device ID</description>
               <addressOffset>0x3F4</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DEVICEID</name>
                     <description>Device ID numbers for LPC11Uxx parts LPC11U12FHN33/201 = 0x095C 802B/0x295C 802B LPC11U12FBD48/201 = 0x095C 802B/0x295C 802B LPC11U13FBD48/201 = 0x097A 802B/0x297A 802B LPC11U14FHN33/201 = 0x0998 802B/0x2998 802B LPC11U14FHI33/201 = 0x2998 802B LPC11U14FBD48/201 = 0x0998 802B/0x2998 802B LPC11U14FET48/201 = 0x0998 802B/0x2998 802B LPC11U23FBD48/301 = 0x2972 402B LPC11U24FHI33/301 = 0x2988 402B LPC11U24FBD48/301 = 0x2988 402B LPC11U24FET48/301 = 0x2988 402B LPC11U24FHN33/401 = 0x2980 002B LPC11U24FBD48/401 = 0x2980 002B LPC11U24FBD64/401 = 0x2980 002B</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
